In [3]:
import pandas as pd

In [11]:
mine = pd.Series([234, 566, 534, 234])
mine

0    234
1    566
2    534
3    234
dtype: int64

In [15]:
nums = pd.DataFrame({'Her\'s':[234, 653, 567, 897], 'mine':mine, 'yours': pd.Series([345, 534, 345, 342])})
nums

   Her's  mine  yours
0    234   234    345
1    653   566    534
2    567   534    345
3    897   234    342

In [ ]:
ours = pd.Series([345, 344, 233, 243])

In [18]:
# Adding a series to a dataframe
teachers = pd.Series(['Muthoni', 'Wanjiku', 'Mr Kariuki', 'Mr Gakumo'], index=[2010, 2012, 2011, 2013]) # The index doesn't have to follow a given sequence
# The DataFrame will move things around to ensure they are on the right index

haters = pd.DataFrame({'names':['Saimo', 'Obara', 'Kimai', 'Tinto'], 'class':['same', 'same', 'same', 'same'], 'teachers':teachers}, index=[2010, 2011, 2012, 2013])
haters

      names class    teachers
2010  Saimo  same     Muthoni
2011  Obara  same  Mr Kariuki
2012  Kimai  same     Wanjiku
2013  Tinto  same   Mr Gakumo

In [24]:
# Accessing values in dataframes using fields
result = haters[haters['class'] == 'same'] # Getting the values infor where the class was the same
result

      names class    teachers
2010  Saimo  same     Muthoni
2011  Obara  same  Mr Kariuki
2012  Kimai  same     Wanjiku
2013  Tinto  same   Mr Gakumo

In [29]:
best = haters[haters['teachers']=='Wanjiku'] # WHere the teacher was..
best
end_sent = haters[haters.index == 2012] # Accessing the values using the index values.
end_sent

      names class teachers
2012  Kimai  same  Wanjiku

In [33]:
# Where the name was Tinto ..
compe = haters[haters['names']=='Tinto']
compe
# Where the name was Kimai...
arif = haters[haters['names']=='Kimai']
arif
# Where the name was Obara...
muscle = haters[haters['names']=='Obara']
muscle

      names class    teachers
2011  Obara  same  Mr Kariuki

In [39]:
# Using the labels < Col names and the index values to access values...
# Accessing multiple values using the index
result = haters.loc[2011:2013]
result

      names class    teachers
2011  Obara  same  Mr Kariuki
2012  Kimai  same     Wanjiku
2013  Tinto  same   Mr Gakumo

In [62]:
# Using the index paired up with the selected cols
# result = haters.loc[2010:2013, 1:2] # Note this will throw out an error since we using the .loc thus col need to be accessed by the label and not index
# The index for the rows is also its label so no error on that side... If using .iloc thus kein problem
# Correct method below
result = haters.loc[2010:2013, ['class', 'teachers']] # Pass the col labels as a list of col names
result
search = haters.loc[2011:2013, ['names', 'teachers']]
search
# Also, you can access specific rows using indexes and skipping others by adding them as a list argument
search = haters.loc[[2010, 2012], :'class'] # Cols upto class and leave the rest out...
search

      names class
2010  Saimo  same
2012  Kimai  same

In [9]:
twice = pd.DataFrame({'ours':pd.Series([345, 434, 543, 566], index=[2000, 2001, 2002, 2003])})
print(twice)

      ours
2000   345
2001   434
2002   543
2003   566

In [78]:
people_dict = { "weight": pd.Series([68, 83, 112],index=["alice", "bob", "charles"]),   "birthyear": pd.Series([1984, 1985, 1992], index=["bob", "alice", "charles"], name="year"),
"children": pd.Series([0, 3], index=["charles", "bob"]),
"hobby": pd.Series(["Biking", "Dancing"], index=["alice", "bob"]),}
people_dict

them = pd.DataFrame(people_dict)
them

         weight  birthyear  children    hobby
alice        68       1985       NaN   Biking
bob          83       1984       3.0  Dancing
charles     112       1992       0.0      NaN

In [47]:
# Creating a DataFrame and specifying the indexes after each data series...
people = pd.DataFrame({'weight(Kgs)':pd.Series([45, 65, 75], index=[2001, 2002, 2003]), 'birthyear':pd.Series([98, 86, 78], index=[2003,2001,2002]), 'children':pd.Series([3,4,5], index=[2002,2001,2003]) })
people

      weight(Kgs)  birthyear  children
2001           45         86         4
2002           65         78         3
2003           75         98         5

In [49]:
# Accessing values by passing the parameters to use to access them
result = people[people['weight(Kgs)'] >= 65]
result

      weight(Kgs)  birthyear  children
2002           65         78         3
2003           75         98         5

In [50]:
result = people[people['children']< 4]
result

      weight(Kgs)  birthyear  children
2002           65         78         3

In [56]:
result = people[people['birthyear'] == 86] # THose born in 1986...
result

      weight(Kgs)  birthyear  children
2001           45         86         4

In [48]:
underweight = people[people['weight(Kgs)'] < 50] # Creating a new DataFrame by setting it to those people that are underweight
underweight

      weight(Kgs)  birthyear  children
2001           45         86         4

In [35]:
does = {'one': [3, 4, 5], 'two': ['name', 'like', 'love'], 'three': [3, 4, 5]}
does = pd.DataFrame(does)
does

   one   two  three
0    3  name      3
1    4  like      4
2    5  love      5

In [36]:
does[does['one']<=4] # Sorting the dataframe based on the conditions given

   one   two  three
0    3  name      3
1    4  like      4

In [38]:
does[does['two']=='name'] # Where the column name is equal to name
does[does['three'] < 5] # Where the three column is less than 5

   one   two  three
0    3  name      3
1    4  like      4

In [64]:
data = {'apples':[2, 4, 5, 3], 'mangoes':[4, 6, 5, 3], 'watermelons':[34, 54, 34, 23]}
purchases = pd.DataFrame(data, index=['Jane', 'Luke', 'Lee', 'Harun'])

purchases

       apples  mangoes  watermelons
Jane        2        4           34
Luke        4        6           54
Lee         5        5           34
Harun       3        3           23

In [104]:
# Locating data using the labels. The .loc function
purchases.loc['Luke'] # The label is Luke. Spits out the purchases made by Luke
purchases.loc['Luke', 'mangoes'] # The second arg specifies the column(s) we want to see.

# All the purchases by Luke and Lee
result = purchases.loc[['Luke', 'Lee'], :]
result

      apples  mangoes  watermelons
Luke       4        6           54
Lee        5        5           34

In [106]:
# Locating values using the index values. The .iloc function
purchases.iloc[:2, :1]

      apples
Jane       2
Luke       4

In [67]:
# Only the mangoes bought by the guys above 
purchases.loc[['Luke', 'Lee'], 'mangoes']

Luke    6
Lee     5
Name: mangoes, dtype: int64

In [70]:
# All the fruits bought by the first two guys
# purchases.loc[:2, :] >> this throws an error since we are accessing using labels and not the locations
#  Instead, you should use the .iloc function
purchases.iloc[:2, :]

      apples  mangoes  watermelons
Jane       2        4           34
Luke       4        6           54

In [73]:
# Locating all the watermelons bought by Harun alone
# We can locate by the label or the index.
purchases.loc['Harun', 'watermelons'] # The labels...

23

In [74]:
# The same as above but using the  index
purchases.iloc[3, 2] # Obviously the index...

23

In [76]:
# All the melons bought by the guys
purchases.iloc[:, 2]

Jane     34
Luke     54
Lee      34
Harun    23
Name: watermelons, dtype: int64

In [103]:
# Selecting specific rows and cols and eliminating everything else..
they = purchases.iloc[[0,2,3], [1,2]]
they

       mangoes  watermelons
Jane         4           34
Lee          5           34
Harun        3           23

In [108]:
# All rows and specific cols
this = purchases.iloc[:, [0, 2]]
this

       apples  watermelons
Jane        2           34
Luke        4           54
Lee         5           34
Harun       3           23

In [109]:
# All cols and specific rows
purchases.iloc[[1, 3], :]

       apples  mangoes  watermelons
Luke        4        6           54
Harun       3        3           23

In [93]:
names = {
    'teenagers': ['Evans', 'George', 'Newton', 'Harun', 'ken', 'Amanda'],
    'adults': ['Jennifer', 'Sam', 'Monica', 'Steve', 'Sylvester', 'Hannah'],
    'cuteness':[False, True, True, False, False, True],
    'tall':pd.Series(['Not', 'Average', 'Tall', 'Above Average', 'Not', 'Average'], index=[1,2,3,4,5,6])
}
names = pd.DataFrame(names)
names

  teenagers     adults  cuteness           tall
1     Evans   Jennifer     False            Not
2    George        Sam      True        Average
3    Newton     Monica      True           Tall
4     Harun      Steve     False  Above Average
5       ken  Sylvester     False            Not
6    Amanda     Hannah      True        Average

In [101]:
tall_guys = names[names['cuteness'] == True]

xx= names[names['cuteness'] == False]
# xx
# tall_guys
xx

  teenagers     adults  cuteness           tall
1     Evans   Jennifer     False            Not
4     Harun      Steve     False  Above Average
5       ken  Sylvester     False            Not

In [114]:
tall = names[names['tall'] == 'Average']
tall

  teenagers  adults  cuteness     tall
2    George     Sam      True  Average
6    Amanda  Hannah      True  Average

In [115]:
names['adults']

1     Jennifer
2          Sam
3       Monica
4        Steve
5    Sylvester
6       Hannah
Name: adults, dtype: object